Revit 2027 API
Element.IsCreatedPhaseOrderValid Method
 Returns true if createdPhaseId and demolishedPhaseId are in order.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsCreatedPhaseOrderValid(
	ElementId createdPhaseId
)
Public Function IsCreatedPhaseOrderValid (
	createdPhaseId As ElementId
) As Boolean
public:
bool IsCreatedPhaseOrderValid(
	ElementId^ createdPhaseId
)
member IsCreatedPhaseOrderValid :
        createdPhaseId : ElementId -> bool
Parameters
createdPhaseId ElementId
 The createdPhaseId.
Return Value
Boolean
 True if createdPhaseId index is less than or equal to demolishedPhaseId, otherwise returns false.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Element Class
Autodesk.Revit.DB Namespace